app/Controllers/CategoryController.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Kategori',
            'categories' => $this->categoryModel->findAll(),
---
SELECT *
FROM `categories`