app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function index()
    {
        // Hitung jumlah transaksi hari ini
        $today = date('Y-m-d');
        $todayTransactions = $this->getTodayTransactionsCount($today);

        $data = [
            'title' => 'Dashboard',
            'total_products' => $this->productModel->countAll(),
            'low_stock_products' => count($this->productModel->getLowStockProducts()),
            'today_transactions' => $todayTransactions,
            'recent_activities' => $this->activityLogModel->getRecentActivities(10)
        ];

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE(date) = '2025-06-20'
---
    private function getTodayTransactionsCount($date)
    {
        $db = \Config\Database::connect();

        $query = $db->table('transactions')
            ->where('DATE(date)', $date)
            ->countAllResults();