app/Controllers/Product.php

SELECT *
FROM `categories`
---
        public function new()
    {
        $data = [
            'title' => 'Tambah Produk',
            'validation' => \Config\Services::validation(),
            'categories' => $this->categoryModel->findAll()
        ];

INSERT INTO `products` (`code`, `name`, `category_id`, `buy_price`, `sell_price`, `stock`, `min_stock`, `description`, `image`, `created_at`, `updated_at`) VALUES ('81471', 'Data', '1', '2000', '2100', '6', '1', 'ddsd', NULL, '2025-06-19 11:52:46', '2025-06-19 11:52:46')
---
        public function create()
    {
        if (!$this->validate($this->productModel->getValidationRules())) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->productModel->save([
            'code' => $this->request->getPost('code'),
            'name' => $this->request->getPost('name'),
            'category_id' => $this->request->getPost('category_id'),
            'buy_price' => $this->request->getPost('buy_price'),
            'sell_price' => $this->request->getPost('sell_price'),
            'stock' => $this->request->getPost('stock'),
            'min_stock' => $this->request->getPost('min_stock'),
            'description' => $this->request->getPost('description'),
            'image' => $this->request->getPost('image'),
        ]);