app/Controllers/Stock.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data = [
            'title' => 'Transaksi Stok',
            'products' => $this->productModel->findAll()

INSERT INTO `transactions` (`transaction_code`, `type`, `date`, `notes`, `user_id`, `created_at`, ) VALUES ('IN-1750393264', 'in', '2025-06-20', 'Pembeli', '2', '2025-06-20 04:21:04', '2025-06-20 04:21:04')
---
    public function stockIn()
    {
        $post = $this->request->getPost(['date', 'description', 'product_id', 'quantity']);

        // 1. Simpan Transaksi Utama
        $transactionData = [
            'transaction_code' => 'IN-' . time(), // Contoh kode transaksi
            'type'             => 'in',
            'date'             => $post['date'],
            'notes'            => $post['description'],
            'user_id'          => session()->get('user_id') // Ambil dari sesi
        ];

        $db = \Config\Database::connect();
        $db->transStart();

        $this->transactionModel->insert($transactionData);

INSERT INTO `transaction_details` (`transaction_id`, `product_id`, `quantity`) VALUES (0, '2', '200')
---
                    'product_id'     => $productId,
                    'quantity'       => $quantity,
                ];
                $this->transactionDetailModel->insert($detailData);

INSERT INTO `activity_logs` (`user_id`, `action`, `description`, `created_at`) VALUES ('2', 'Stok Masuk', 'Menambahkan 1 item produk baru. Deskripsi: Pembeli', '2025-06-20 04:21:04')
---
        }

        // 3. Log Aktivitas
        $this->activityLogModel->insert([
            'user_id' => session()->get('user_id'),
            'action'  => 'Stok Masuk',
            'description' => 'Menambahkan ' . $totalItems . ' item produk baru. Deskripsi: ' . $post['description']
        ]);