app/Models/ActivityLogModel.php

    public function getRecentActivities($limit = 10)
    {
        return $this->select('activity_logs.*, users.name as user_name')
                    ->join('users', 'users.id = activity_logs.user_id')
                    ->orderBy('activity_logs.created_at', 'DESC')
                    ->limit($limit)
                    ->find();
---
SELECT `activity_logs`.*, `users`.`name` as `user_name`
FROM `activity_logs`
JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
ORDER BY `activity_logs`.`created_at` DESC
 LIMIT 10