app/Models/CategoryModel.php

    public function getCategoryWithProductCount()
    {
        return $this->select('categories.*, COUNT(products.id) as product_count')
                    ->join('products', 'products.category_id = categories.id', 'left')
                    ->groupBy('categories.id')
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `categories`.*, COUNT(products.id) as product_count
FROM `categories`
LEFT JOIN `products` ON `products`.`category_id` = `categories`.`id`
GROUP BY `categories`.`id`
) CI_count_all_results
SELECT `categories`.*, COUNT(products.id) as product_count
FROM `categories`
LEFT JOIN `products` ON `products`.`category_id` = `categories`.`id`
GROUP BY `categories`.`id`
 LIMIT 20