app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function getProductWithCategory($id = null)
    {
        $builder = $this->db->table('products');
        $builder->select('products.*, categories.name as category_name');
        $builder->join('categories', 'categories.id = products.category_id');

        if ($id !== null) {
            return $builder->where('products.id', $id)->get()->getRowArray();
        }

        return $builder->get()->getResultArray();

SELECT *
FROM `products`
WHERE stock <= min_stock
---
    public function getLowStockProducts()
    {
        return $this->where('stock <=', 'min_stock', false)->findAll();